# FinalWorkMainUnitGeek

## *__Задача__*
Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.

Примеры:
```
[“Hello”, “2”, “world”, “:-)”] → [“2”, “:-)”]
[“1234”, “1567”, “-2”, “computer science”] → [“-2”]
[“Russia”, “Denmark”, “Kazan”] → []
```
1. Создать метод, с помощью которого можно задать массив из строк *```string[] CreateStringArray()```*. *В этом методе есть запрос на количество строк, которе будет вводиться: ```Console.Write("Введите количество строк: "); int countstr = Convert.ToInt32(Console.ReadLine());```. А также создаем запрос на ввод ссамих строк: ```Console.Write($"Введите строку {i + 1}: "); stringarray[i] = Console.ReadLine();```.*

2. Создать метод, с помощью которого можно выводить массив строк, которые уже ввели, или который уже существует *```void PrintStringArray(string[] arraystring)```*.

3. Создать метод, с помощью которого будем искать количество элентов для нового массива строк *```int FindNewSize(string[] strfornewsize)```*.

4. Создать метод, с поомщью которого из заданного элемента массива строк идет поиск элемента с 3 и меньшим количеством символов, и запись этого элемента в новый массив строк *```string[] FindShortString(string[] strforsearch, int c)```*.

5. Использовать полученные методы:
    - задать массив строк;
    - вывести на экран введенную строку;
    - поиск элементов, которые имеют меньше чем 3 символа, размер нового массива строк;
    - запись в новый массив строк элементов, в которых 3 и меньше символовж
    - вывод на экран, получившийся массив строк.